class RangeData {
  constructor (startTime, endTime, info) {
    this.startTime = startTime
    this.endTime = endTime
    this.info = info
  }

  isUp (data) {
    return this.info.findIndex(item => data.name === item) > -1
  }
}

const upInfo = [
  new RangeData('2020-09-28 18:00:00', '2020-10-18 18:00:00', ['温迪']),
  new RangeData('2020-10-20 10:00:00', '2020-11-10 18:00:00', ['可莉']),
  new RangeData('2020-11-11 10:00:00', '2020-12-01 18:00:00', ['达达利亚']),
  new RangeData('2020-12-01 18:00:00', '2020-12-22 18:00:00', ['钟离']),
  new RangeData('2020-12-23 10:00:00', '2021-01-12 18:00:00', ['阿贝多']),
  new RangeData('2021-01-12 18:00:00', '2021-02-02 18:00:00', ['甘雨']),
  new RangeData('2021-02-03 10:00:00', '2021-02-17 18:00:00', ['魈']),
  new RangeData('2021-02-17 18:00:00', '2021-03-02 18:00:00', ['刻晴']),
  new RangeData('2021-03-02 18:00:00', '2021-03-16 18:00:00', ['胡桃']),
  new RangeData('2021-03-17 10:00:00', '2021-04-06 18:00:00', ['温迪']),
  new RangeData('2021-04-06 18:00:00', '2021-04-27 18:00:00', ['达达利亚']),
  new RangeData('2021-04-28 10:00:00', '2021-05-18 18:00:00', ['钟离']),
  new RangeData('2021-05-18 18:00:00', '2021-06-08 18:00:00', ['优菈']),
  new RangeData('2021-06-09 10:00:00', '2021-06-29 18:00:00', ['可莉']),
  new RangeData('2021-06-29 18:00:00', '2021-07-20 18:00:00', ['枫原万叶']),
  new RangeData('2021-07-21 10:00:00', '2021-08-10 18:00:00', ['神里绫华']),
  new RangeData('2021-08-10 18:00:00', '2021-08-31 18:00:00', ['宵宫']),
  new RangeData('2021-09-01 10:00:00', '2021-09-21 18:00:00', ['雷电将军']),
  new RangeData('2021-09-21 18:00:00', '2021-10-12 18:00:00', ['珊瑚宫心海']),
  new RangeData('2021-10-13 10:00:00', '2021-11-02 18:00:00', ['达达利亚']),
  new RangeData('2021-11-02 18:00:00', '2021-11-23 18:00:00', ['胡桃']),
  new RangeData('2021-11-24 10:00:00', '2021-12-14 18:00:00', ['阿贝多', '优菈']),
  new RangeData('2021-12-14 18:00:00', '2022-01-04 18:00:00', ['荒泷一斗']),
  new RangeData('2022-01-05 10:00:00', '2022-01-25 18:00:00', ['魈', '申鹤']),
  new RangeData('2022-01-25 18:00:00', '2022-02-15 18:00:00', ['甘雨', '钟离']),
  new RangeData('2022-02-16 10:00:00', '2022-03-08 18:00:00', ['八重神子']),
  new RangeData('2022-03-08 18:00:00', '2022-03-29 18:00:00', ['珊瑚宫心海', '雷电将军']),
  new RangeData('2022-03-30 10:00:00', '2022-04-19 18:00:00', ['温迪', '神里绫人']),
  new RangeData('2022-04-19 18:00:00', '2022-05-10 18:00:00', ['神里绫华']),
  new RangeData('2022-05-31 18:00:00', '2022-06-21 18:00:00', ['夜兰', '魈']),
  new RangeData('2022-06-21 18:00:00', '2022-07-12 18:00:00', ['荒泷一斗']),
  new RangeData('2022-07-13 10:00:00', '2022-08-02 18:00:00', ['可莉', '枫原万叶']),
  new RangeData('2022-08-02 18:00:00', '2022-08-23 18:00:00', ['宵宫']),
  new RangeData('2022-08-24 10:00:00', '2022-09-09 18:00:00', ['提纳里', '钟离']),
  new RangeData('2022-09-09 18:00:00', '2022-09-27 18:00:00', ['甘雨', '珊瑚宫心海']),
  new RangeData('2022-09-28 10:00:00', '2022-10-14 18:00:00', ['赛诺', '温迪']),
  new RangeData('2022-10-14 18:00:00', '2022-11-01 18:00:00', ['妮露', '阿贝多']),
  new RangeData('2022-11-02 10:00:00', '2022-11-18 18:00:00', ['纳西妲', '宵宫']),
  new RangeData('2022-11-18 18:00:00', '2022-12-06 18:00:00', ['八重神子', '达达利亚']),
  new RangeData('2022-12-07 10:00:00', '2022-12-26 18:00:00', ['流浪者', '荒泷一斗']),
  new RangeData('2022-12-27 18:00:00', '2023-01-17 18:00:00', ['雷电将军', '神里绫人']),
  new RangeData('2023-01-18 10:00:00', '2023-02-07 18:00:00', ['魈', '艾尔海森']),
  new RangeData('2023-02-07 18:00:00', '2023-02-28 18:00:00', ['胡桃', '夜兰']),
  new RangeData('2023-03-01 10:00:00', '2023-03-21 18:00:00', ['迪希雅', '赛诺']),
  new RangeData('2023-03-21 18:00:00', '2023-04-11 18:00:00', ['神里绫华', '申鹤']),
  new RangeData('2023-04-12 10:00:00', '2023-05-02 18:00:00', ['纳西妲', '妮露']),
  new RangeData('2023-05-02 18:00:00', '2023-05-21 18:00:00', ['白术', '甘雨'])
]
// const wqInfo = []
const isInUp = (data, type) => {
  let bool = false
  if (type) {
    const index = upInfo.findIndex(up => {
      const startTime = new Date(up.startTime).getTime()
      const endTime = new Date(up.endTime).getTime()
      const t = new Date(data.time).getTime()
      if (t <= endTime && t >= startTime) {
        return true
      }
      return false
    })
    if (index > 0 && upInfo[index].isUp(data)) {
      bool = true
    }
  }
  return bool
}

export { isInUp }
